## 3.10: `DISTINCT` – Unieke waarden selecteren

Stel dat je alle woonplaatsen wilt zien van de tabel <i>klant</i>.


| plaats     |
|------------|
| Enschede   |
| Enschede   |
| Enschede   |
| Enschede   |
| Hengelo    |
| Enschede   |
| Enschede   |
| ...        |


<p>Je ziet dat er dubbele waarden te zien zijn. Om te voorkomen dat er dubbele waarden worden getoond, kun je DISTINCT gebruiken.</p>
 
<p>Met <code>DISTINCT kolom</code> toon je alleen <b>verschillende (unieke)</b> waarden uit een kolom. </p>


<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="35%">

Bijvoorbeeld: alle verschillende plaatsen waar klanten wonen.

```sql
SELECT DISTINCT plaats
FROM klant;
```
</td><td width="65%">

<table border="1">
  <thead>
    <tr>
      <th>plaats</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>Enschede</td></tr>
    <tr><td>Hengelo</td></tr>
  </tbody>
</table>

</td></tr></table>


### Verwerkingsopdracht 3.10.1 Unieke bezorgdata

<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="35%">
Toon alle unieke bezorgdata in de tabel <i>bestelling</i>. Dus: elke bezorgdatum mag maar één keer voorkomen.
</td><td width="65%">
  <table border="1">
  <thead>
    <tr>
      <th>bestel_datum</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>2021-12-01</td></tr>
    <tr><td>2021-12-02</td></tr>
    <tr><td>2021-12-03</td></tr>
    <tr><td>2021-12-04</td></tr>
    <tr><td>2021-12-05</td></tr>
    <tr><td>...</td></tr>
    <tr><td>2022-03-03</td></tr>
  </tbody>
</table>

</td></tr></table>


<p>Bekijk <a
href="https://rweeda.github.io/PythonIA/docs/IA_sql_oplossingen.html#opgave3101"
target="_blank">hier</a> de voorbeelduitwerking.</p>